---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWFExportAvailable
source: html/b16130da-6415-6f7d-bd08-9d984c59d5cb.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWFExportAvailable Method

Checks whether the DWF/DWFx Export functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDWFExportAvailable()
```

## Returns
True if the DWF/DWFx Export functionality is available in the installed Revit.

## Remarks
DWF/DWFx Export requires presence of certain modules that are optional and may not be part of the installed Revit.